app/views/students/index.html.erb

SELECT "course_students".* FROM "course_students" WHERE "course_students"."student_id" = ?  [["student_id", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "course_students" ON "courses"."id" = "course_students"."course_id" WHERE "course_students"."student_id" = ?  [["student_id", 1]]
---
          <td><%= student.transfer_hours %></td>
          <% student.course_students.each do |coursestudent| %>