app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "courses"
---
  def index
    @courses = Course.all.paginate(:page => params[:page])

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."name" = ? LIMIT ?  [["name", "Kirksey, H"], ["LIMIT", 1]]
INSERT INTO "instructors" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", 2017-04-05 02:02:08 UTC], ["updated_at", 2017-04-05 02:02:08 UTC], ["name", "Kirksey, H"]]
INSERT INTO "courses" ("term", "rubric", "course_number", "section", "credit_hours", "course_type", "day", "time", "instructor", "created_at", "updated_at", "instructor_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def to_db
    course = Course.new()
    added_rows = 0
    rows=0
    CSV.foreach(params[:file].path, :headers => true) do |row|
      data = row.to_hash
      instr = Instructor.find_by(fname: data['Instructor'])
      if instr.blank?
        instr_id = (Instructor.create(:fname => data['Instructor'])).id
      else
        instr_id = instr.id
      end
      #byebug
      course = Course.new(
                         :term => (data['Term']).to_i,
                         :rubric => data['Prefix'],
                         :course_number => (data['Number']).to_i,
                         :section => data['Sect'],
                         :credit_hours => (data['Credit']).to_i,
                         :day => data['Days'],
                         :time => data['Start'],
                         :instructor => data['Instructor'],
                         :course_type => data['Type'],
                         :instructor_id => instr_id.to_i
      )

      if course.save!