app/controllers/students_controller.rb

  def index
    @students = Student.all.paginate(:page => params[:page])
---
SELECT  "students".* FROM "students" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "students"

  def to_db
    student = Student.new();
    added_rows = 0
    rows = 0
    CSV.foreach(params[:file].path, :headers => true) do |row|
      data = row.to_hash
      student = Student.new(
                            :lname => (data['Last Name']),
                            :fname => (data['First Name']),
                            :uid => (data['UID']),
                            :transfer_hours => (data['TREH']).to_i,
      )
      student.save
      #course = Course.find_by(course_number: (data['Number']).to_i)
      course = Course.find_by_course_number_and_term((data['Number']).to_i, (data['Term']).to_i)
      #course = Course.new(:
      student = Student.find_by(uid: (data['UID']))
      if not student.courses.include?(course)
        student.courses << course
        relation = student.course_students.find_by(course: course)
        if not data['Grade'].blank?
          relation.grade = data['Grade']
        end
        @courses = Course.where(course_number: (data['Number']).to_i)
        @courses.each do |c|
          if student.courses.include?(c)
            newrelation = student.course_students.find_by(course: c)
            if (relation.grade == "D" or relation.grade == "D+" or relation.grade == "F" or relation.grade == "U")
              newrelation.increment
---
INSERT INTO "students" ("uid", "fname", "lname", "transfer_hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["uid", "F00100005"], ["fname", "Zachary"], ["lname", "Epperson"], ["transfer_hours", 0], ["created_at", 2017-04-05 00:51:11 UTC], ["updated_at", 2017-04-05 00:51:11 UTC]]
SELECT  "students".* FROM "students" WHERE "students"."uid" = ? LIMIT ?  [["uid", "F00100005"], ["LIMIT", 1]]
SELECT  1 AS one FROM "courses" INNER JOIN "course_students" ON "courses"."id" = "course_students"."course_id" WHERE "course_students"."student_id" = ? AND "courses"."id" = ? LIMIT ?  [["student_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "students" WHERE "students"."uid" = ? AND ("students"."id" != ?) LIMIT ?  [["uid", "F00100005"], ["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"
SELECT "students".* FROM "students"
INSERT INTO "course_students" ("attempt", "student_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["attempt", 0], ["student_id", 1], ["course_id", 1], ["created_at", 2017-04-05 02:25:15 UTC], ["updated_at", 2017-04-05 02:25:15 UTC]]
SELECT  "course_students".* FROM "course_students" WHERE "course_students"."student_id" = ? AND "course_students"."course_id" = 1110 LIMIT ?  [["student_id", 89], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."course_number" = ? LIMIT ?  [["course_number", 1110], ["LIMIT", 1]]
SELECT  1 AS one FROM "course_students" WHERE "course_students"."student_id" = ? AND "course_students"."id" IS NULL LIMIT ?  [["student_id", 91], ["LIMIT", 1]]
UPDATE "course_students" SET "attempt" = ?, "updated_at" = ? WHERE "course_students"."id" = ?  [["attempt", 1], ["updated_at", 2017-04-05 17:13:33 UTC], ["id", 1]]
UPDATE "students" SET "fname" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["fname", "yolo"], ["updated_at", 2017-04-05 17:13:33 UTC], ["id", 1]]