app/controllers/students_controller.rb

  def to_db
    @courses = Course.all
    student = Student.new();
    added_rows = 0
    rows = 0
    CSV.foreach(params[:file].path, :headers => true) do |row|
      data = row.to_hash
      student = Student.new(
                            :lname => (data['Last Name']),
                            :fname => (data['First Name']),
                            :uid => (data['UID']),
                            :transfer_hours => (data['TREH']).to_i,
      )
      if student.save
        added_rows = added_rows + 1
      end
      rows = rows + 1
      tmpcourse = @courses.find_by course_number: data['Number'].to_i
      if student.course_students.exists?(:id => params[:id])
        student.tmpcourse.where(:id => params[:id]).attempt += 1
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]